# Дополнительная задача 2.
# Количество слов
# Дана строка, состоящая из слов, разделенных пробелами. Напишите программу, которая подсчитывает количество слов 
# в этой строке. На вход программе подается строка. Программа должна вывести количество слов в строке.
# Кроме слов в тексте могут присутствовать только пробелы (один или несколько). 
# Решите задачу в одну строчку кода.
# Hello world - 2
# Timur forever young - 3

print(input("Введите строку: ").count(' ') + 1)